{
    "fun": [
        "Banging your head against a wall for one hour burns 150 calories.",
        "Pteronophobia is the fear of being tickled by feathers.",
        "Snakes can help predict earthquakes.",
        "The oldest “your mom” joke was discovered on a 3,500 year old Babylonian tablet.",
        "So far, two diseases have successfully been eradicated: smallpox and rinderpest.",
        "29th May is officially “Put a Pillow on Your Fridge Day”.",
        "Cherophobia is an irrational fear of fun or happiness.",
        "7% of American adults believe that chocolate milk comes from brown cows.",
        "If you lift a kangaroo’s tail off the ground it can’t hop.",
        "Bananas are curved because they grow towards the sun.",
        "Billy goats urinate on their own heads to smell more attractive to females.",
        "The inventor of the Frisbee was cremated and made into a Frisbee after he died.",
        "During your lifetime, you will produce enough saliva to fill two swimming pools.",
        "If Pinocchio says “My Nose Will Grow Now”, it would cause a paradox.",
        "Polar bears could eat as many as 86 penguins in a single sitting…",
        "King Henry VIII slept with a gigantic axe beside him.",
        "Movie trailers were originally shown after the movie, which is why they were called “trailers”.",
        "An eagle can kill a young deer and fly away with it.",
        "Heart attacks are more likely to happen on a Monday.",
        "Tennis players are not allowed to swear when they are playing in Wimbledon.",
        "In 2017 more people were killed from injuries caused by taking a selfie than by shark attacks.",
        "The top six foods that make your fart are beans, corn, bell peppers, cauliflower, cabbage and milk.",
        "There is a species of spider called the Hobo Spider.",
        "A lion’s roar can be heard from 5 miles away.",
        "Saint Lucia is the only country in the world named after a woman.",
        "A baby spider is called a spiderling.",
        "The United States Navy has started using Xbox controllers for their periscopes.",
        "The following can be read forward and backwards: Do geese see God?",
        "A baby octopus is about the size of a flea when it is born.",
        "A sheep, a duck and a rooster were the first passengers in a hot air balloon.",
        "In Uganda, around 48% of the population is under 15 years of age.",
        "The average male gets bored of a shopping trip after 26 minutes.",
        "In the 16th Century, Arab women could initiate a divorce if their husbands didn’t pour coffee for them.",
        "Recycling one glass jar saves enough energy to watch television for 3 hours.",
        "After the premiere of “16 and Pregnant,” teen pregnancy rates dropped.",
        "Approximately 10-20% of U.S. power outages are caused by squirrels.",
        "Facebook, Instagram and Twitter are all banned in China.",
        "95% of people text things they could never say in person.",
        "Honeybees can recognize human faces.",
        "The Battle of Hastings didn’t take place in Hastings.",
        "While trying to find a cure for AIDS, the Mayo Clinic made glow in the dark cats.",
        "A swarm of 20,000 bees followed a car for two days because their queen was stuck inside.",
        "Nearly 3% of the ice in Antarctic glaciers is penguin urine.",
        "Bob Dylan’s real name is Robert Zimmerman.",
        "A crocodile can’t poke its tongue out.",
        "Sea otters hold hands when they sleep so they don’t drift away from each other.",
        "A small child could swim through the veins of a blue whale.",
        "Bin Laden’s death was announced on 1st May 2011. Hitler’s death was announced on 1st May 1945.",
        "J.K. Rowling chose the unusual name ‘Hermione’ so young girls wouldn’t be teased for being nerdy.",
        "Hewlett-Packard’s (also known as HP) name was decided in a coin toss in 1939.",
        "There is a total of 1,710 steps in the Eiffel Tower.",
        "The Pokémon Hitmonlee and Hitmonchan are based off of Bruce Lee and Jackie Chan.",
        "A woman once tried to commit suicide by jumping off the Empire State Building. She jumped from the 86th floor but was blown back onto the 85th floor by a gust of wind.",
        "Pirates wore earrings because they believed it improved their eyesight.",
        "Los Angeles’s full name is “El Pueblo de Nuestra Senora la Reina de los Angeles de Porciuncula.”",
        "The Twitter bird actually has a name – Larry.",
        "Octopuses have four pairs of arms.",
        "In the popular sitcom, Parks and Recreation, the writers had no idea Nick Offerman was a talented saxophone player when they wrote the Duke Silver plot line.",
        "It snowed in the Sahara desert for 30 minutes on the 18th February 1979.",
        "Mike Tyson once offered a zoo attendant 10,000 dollars to let him fight a gorilla.",
        "ABBA turned down 1 billion dollars to do a reunion tour.",
        "There has never been a verified snow leopard attack on a human being.",
        "The first alarm clock could only ring at 4 a.m.",
        "Birds don’t urinate.",
        "Dying is illegal in the Houses of Parliaments.",
        "The most venomous jellyfish in the world is the Irukandji.",
        "The 20th of March is Snowman Burning Day.",
        "Queen Elizabeth can’t sit on the Iron Throne from Game of Thrones.",
        "There is official Wizard of New Zealand.",
        "An apple, potato, and onion all taste the same if you eat them with your nose plugged.",
        "Vincent van Gogh only sold one painting in his lifetime.",
        "A company in Taiwan makes dinnerware out of wheat, so you can eat your plate!",
        "The average person walks the equivalent of five times around the world in their lifetime.",
        "Michael Jackson offered to make a Harry Potter musical, but J.K. Rowling rejected the idea.",
        "The world record for stuffing drinking straws into your mouth at once is 459.",
        "Nutella was invented during WWII, when hazelnuts were mixed into chocolate to extend chocolate rations.",
        "In 2011, more than 1 in 3 divorce filings in the U.S. contained the word “Facebook.”",
        "According to Genesis 1:20-22 the chicken came before the egg.",
        "Honeybees can get drunk on fermented tree sap.",
        "Tears contain a natural pain killer which reduces pain and improves your mood.",
        "Squirrels forget where they hide about half of their nuts.",
        "Millions of birds a year die from smashing into windows in the U.S. alone.",
        "Dolly Parton lost in a Dolly Parton look-alike contest.",
        "George W. Bush was once a cheerleader.",
        "In total, there are 205 bones in the skeleton of a horse.",
        "Coca-Cola owns all website URLs that can be read as ahh, all the way up to 62 h’s.",
        "Each year there are more than 40,000 toilet related injuries in the United States.",
        "Strawberries can be red, yellow, green or white.",
        "Mewtwo is a clone of the Pokémon Mew, yet it comes before Mew in the Pokédex.",
        "Four people lived in a home for 6 months infested with about 2,000 brown recluse spiders, but none of them were harmed.",
        "Madonna suffers from brontophobia, which is the fear of thunder.",
        "In June 2017, the Facebook community reached 2 billion active users.",
        "Samuel L. Jackson requested to have a purple lightsaber in Star Wars in order for him to accept the part as Mace Windu.",
        "Paraskavedekatriaphobia is the fear of Friday the 13th.",
        "Kleenex tissues were originally used as filters in gas masks.",
        "In 1998, Sony accidentally sold 700,000 camcorders that had the technology to see through people’s clothes.",
        "During your lifetime, you will spend around thirty-eight days brushing your teeth.",
        "Ronald McDonald is “Donald McDonald” in Japan because it makes pronunciation easier for the Japanese.",
        "You are cute and that is the truth."
    ],

    "random": [
        "Mister Rogers always mentioned out loud that he was feeding his fish because a young blind viewer once asked him to do so. She wanted to know the fish were OK.",
        " Boring, Oregon and Dull, Scotland have been sister cities since 2012. In 2017, they added Bland Shire, Australia to their \"League of Extraordinary Communities.\"",
        "Amelia Earhart and Eleanor Roosevelt once sneaked out of a White House event, commandeered an airplane, and went on a joyride to Baltimore.",
        "If you have the feeling you’ve experienced an event before in real life, call it déjà vu. If you feel like you’ve previously experienced an event in a dream instead, there’s a different term for it: déjà rêvé.",
        "During Prohibition, moonshiners would wear \"cow shoes.\" The fancy footwear left hoofprints instead of footprints, helping distillers and smugglers evade police.",
        "Since founding the Imagination Library in 1995, Dolly Parton has donated 100 million books to children.",
        "The 100 folds in a chef's toque are said to represent 100 ways to cook an egg.",
        "In curling, good sportsmanship and politeness are essential. Congratulating opponents and abstaining from trash talk are part of what's known as the \"Spirit of Curling.\"",
        "In 1974, the Journal of Applied Behavior Analysis published a paper titled \"The Unsuccessful Self-Treatment of a Case of \"Writer's Block.\" It contained a total of zero words.",
        "Guinness estimates that 93,000 liters of beer are lost in facial hair each year in the UK alone.",
        "George Washington served an eggnog-like drink to visitors at Mount Vernon. His recipe included rye whiskey, rum, and sherry.",
        "Some cats are allergic to humans.",
        "Queen Elizabeth II is a trained mechanic.",
        "Volvo gave away the 1962 patent for their revolutionary three-point seat belt for free, in order to save lives.",
        "Tsundoku is the act of acquiring books and not reading them.",
        "Ravens in captivity can learn to talk better than parrots.",
        "Bela Lugosi was buried in full Dracula costume—cape and all.",
        "Central Park's lampposts contain a set of four numbers that can help you navigate. The first two tell you the nearest street, and the next two tell you whether you're closer to the east or west side of the park (even numbers signal east, odd signals west).",
        "A teacher wrote of a young Roald Dahl on his school report card: \"I have never met anybody who so persistently writes words meaning the exact opposite of what is intended.\"",
        "You can still visit Blockbuster stores in Alaska and Oregon.",
        "Blood donors in Sweden receive a thank you text when their blood is used.",
        "Kea parrots warble together when they're in a good mood, making them the first known non - mammal species to communicate with infectious laughter.",
        "Long before rap battles, there was \"flyting\": the exchange of witty, insulting verses. The verbal throwdowns were popular in England and Scotland from the 5th to 16th centuries.",
        "Melbourne gave some of its trees email addresses so residents could report problems. Instead, the trees received love letters.",
        "An estimated 1 million dogs in the U.S. have been named primary beneficiary in their owners'wills.",
        "At Petrified Forest National Park, visitors sometimes break the rules (and the law) by taking rocks home with them. According to rangers, they often end up returning the stolen goods in the mail—along with an apology note.",
        "The Russians showed up 12 days late to the 1908 Olympics in London because they were using the Julian calendar instead of the Gregorian calendar.",
        "Maya Angelou was the first black female streetcar conductor in San Francisco.",
        "In Japan, letting a sumo wrestler make your baby cry is considered good luck.",
        "J.K. Simmons has been the voice of the Yellow Peanut M&M since the late 1990s.",
        "Count von Count's love of numbers isn't just a quirky character trait—in traditional vampire folklore, the bloodsuckers have arithmomania, a compulsion to count.",
        "In Great Britain and Japan, black cats are perceived as auspicious. In the English Midlands, new brides are given black cats to bless their marriage, and the Japanese believe that black cats are good luck—particularly for single women.",
        "Portland was named by a coin flip. Had the coin landed the other way, the city would be Boston, Oregon.",
        "During World War I, a Canadian soldier made a black bear his pet and named her Winnipeg. “Winnie” was later a resident of the London Zoological Gardens where she was an adored attraction, especially to a boy named Christopher Robin, son of author A.A. Milne. The boy even named his teddy bear after her.",
        "Sleep literally cleans your brain. During slumber, more cerebrospinal fluid flushes through the brain to wash away harmful proteins and toxins that build up during the day.",
        "Neil Armstrong's astronaut application arrived a week past the deadline.A friend slipped the tardy form in with the others.",
        "Due to the restaurant's reputation for staying open in extreme weather, the so - called“ Waffle House Index” is informally used by FEMA to gauge storm severity.",
        "The first sales pitch for the Nerf ball was “Nerf: You can’t hurt babies or old people!”",
        "The manchineel tree is nicknamed the \"Tree of Death\" for good reason: Touching it can leave chemical burns on your skin, its fruit is toxic, and its bark—when burned—can cause blindness.",
        "If drivers adhere to the 45 mph speed limit on a stretch of Route 66 in New Mexico, the road's rumble strips will play a rendition of \"America the Beautiful.\"",
        "Russian cosmonauts used to pack a shotgun in case they landed in Siberia and had to fend off bears.",
        "Space has a distinct smell: a bouquet of diesel fumes, gunpowder, and barbecue. The aroma is mostly produced by dying stars.",
        "Before settling on the Seven Dwarfs we know today, Disney considered Chesty, Tubby, Burpy, Deafy, Hickey, Wheezy, and Awful.",
        "The annual number of worldwide shark bites is 10 times less than the number of people bitten by other people in New York.",
        "In 1997 a Louisville woman left actor Charles Bronson all of her money in a handwritten will—a total of about $300,000. She'd never met him;she was just a fan.",
        "Carly Simon's dad is the Simon of Simon and Schuster.He co - founded the company.",
        "Ben & Jerry learned how to make ice cream by taking a $5 correspondence course offered by Penn State. (They decided to split one course.)",
        "After an online vote in 2011, Toyota announced that the official plural of Prius was Prii.",
        "At the 1905 wedding of Franklin and Eleanor Roosevelt, President Teddy Roosevelt gave away the bride.",
        "Tootsie Rolls were added to soldiers'rations in World War II for their durability in all weather conditions.",
        "After OutKast sang \"Shake it like a Polaroid picture, \" Polaroid released a statement: \"Shaking or waving can actually damage the image.\"",
        "Marie Curie remains the only person to earn Nobel prizes in two different sciences.",
        "The Starry Night depicts Vincent van Gogh's view from the Saint - Paul de Mausole asylum.",
        "A solar eclipse helped end a six-year war in 585 BCE. When the sky suddenly darkened during a battle between the Lydians and the Medes in modern Turkey, soldiers took it as a sign to cease fighting.",
        "Wendy's founder Dave Thomas dropped out of high school but earned his GED in 1993. His GED class voted him Most Likely to Succeed.",
        "Both John Adams and Thomas Jefferson died on July 4, 1826—exactly 50 years after the adoption of the Declaration of Independence.",
        "Dogs are capable of understanding up to 250 words and gestures. The average dog is as intelligent as a two-year-old child.",
        "Bubbles keep your bath water warmer longer.",
        "Scientists have found evidence of take-out restaurants in the remains of Pompeii.",
        "Fried chicken was brought to America by Scottish immigrants.",
        "Peter Durand patented the tin can in 1810. Ezra Warner patented a can opener in 1858. In between, people used chisels and hammers.",
        "There are 71 streets in Atlanta with \"Peachtree\" in their name.",
        "The bend in a flamingo's leg isn't a knee—it's an ankle.",
        "In 1946, Boston owner Walter Brown chose the nickname Celtics over Whirlwinds, Olympians, and Unicorns.",
        "After It's the Great Pumpkin, Charlie Brown aired, Charles Schulz was overwhelmed with candy shipments sent from kids who were concerned for Charlie, who got rocks instead of treats in his Halloween sack.",
        "One of the world's largest stockpiles of nuclear weapons— a U.S.Navy base near Seattle— is partially defended by trained dolphins.",
        "It's illegal for supermarkets in France to waste food. Supermarkets must either compost it or donate unsold or nearly expired goods to charity.",
        "Fredric Baur invented the Pringles can. When he passed away in 2008, his ashes were buried in one.",
        "A new baby can cost new parents 750 hours of sleep in the first year.",
        "In 1965, a Senate subcommittee predicted that by 2000, Americans would only be working 20 hours a week with seven weeks vacation.",
        "For one day in 1998, Topeka, Kansas, renamed itself \"ToPikachu\" to mark Pokemon's U.S.debut.",
        "Truman Capote said he was the only person who'd met John F.Kennedy, Bobby Kennedy, Lee Harvey Oswald, and Sirhan Sirhan.",
        "Susan B. Anthony was fined $100 for voting in the 1872 election. She never paid the fine.",
        "Canned pumpkin isn't actually pumpkin.Even purees that advertise as \"100 percent pumpkin\" are actually made of a range of different winter squashes.",
        "When Gene Wilder accepted the role of Willy Wonka, he had one condition: In his first appearance, Wilder wanted Wonka to limp toward the crowd with a cane in hand before falling into a perfect somersault and jumping back up. The reason? “Because from that time on, no one will know if I’m lying or telling the truth.”",
        "Dr. Seuss said he expected to spend \"a week or so \" writing The Cat in the Hat. It actually took a year and a half.",
        "The Reese in Reese's Peanut Butter Cups is Harry Burnett Reese, a former Hershey employee who created his famous candy in the 1920 s.",
        "The plural of cul-de-sac is culs-de-sac.",
        "Apollo 17 astronaut Harrison Schmitt was allergic to moon dust.",
        "At the Gettysburg reunion in 1913, two men purchased a hatchet, walked to the site where their regiments had fought, and buried it.",
        "\"Bloodcurdling\" isn't just an expression: Research shows that watching horror movies can increase a certain clotting protein in our bloodstreams.",
        "An episode of Peppa Pig was pulled from Australian television for teaching children not to fear spiders.",
        "A group of pugs is called a grumble.",
        "Before he wrote Goosebumps, R.L. Stine wrote the jokes for Bazooka Joe wrappers.",
        "In 1998, the U.S. Army tried developing a telepathic ray gun \"where words could be transmitted to be heard like the spoken word, except that it could only be heard within a person’ s head.\"",
        "In 1967, the Nigerian Civil War ground to a halt for two days because both sides wanted to watch Pelé play in an exhibition soccer match.",
        "Winston Churchill's mother was born in Brooklyn.",
        "Jim Cummings is the voice of Winnie the Pooh. He calls sick kids in hospitals and chats with them in character.",
        "Before Google launched Gmail, \"G - Mail\" was the name of a free email service offered by Garfield's website.",
        "Before the Nazis invaded Paris, H.A. and Margret Rey fled on bicycles. They were carrying the manuscript for Curious George.",
        "In colonial America, lobster wasn't exactly a delicacy.It was so cheap and plentiful it was often served to prisoners.",
        "Crayola means \"oily chalk.\" The name combines craie (French for \"chalk\") and ola (short for \"oleaginous,\" or \"oily\").",
        "Truman Show Delusion is a mental condition marked by a patient's belief that he or she is the star of an imaginary reality show.",
        "Cookie Monster is not changing his name. In a 2012 episode he said, \"We've got to stop this Veggie Monster rumor before me reputation ruined.\"",
        "Google's founders were willing to sell to Excite for under $1 million in 1999— but Excite turned them down.",
        "The medical term for ice cream headaches is sphenopalatine ganglioneuralgia.",
        "Although Dr. James Naismith invented basketball, he’s the only Kansas Jayhawks basketball coach with a losing record.",
        "Wisconsin is the Badger State because the area's lead miners used to spend winters in tunnels burrowed into hills.Like badgers.",
        "In 1999, the U.S. government paid the Zapruder family $16 million for the film of JFK's assassination.",
        "Before he became president, Abraham Lincoln was wrestling champion of his county. He fought in nearly 300 matches and lost only one.",
        "How many licks does it take to get to the center of a Tootsie Pop? The world may never know. But on average, a Licking Machine made at Purdue needed 364.",
        "Barcelona is home to hundreds of playgrounds for seniors. The spaces are meant to promote fitness and combat loneliness in elderly citizens.",
        "In Switzerland, it's illegal to own only one guinea pig.",
        "After leaving office, Ronald Reagan was offered the role of Hill Valley's mayor in Back to the Future III.",
        "Foreign Accent Syndrome is a rare side effect of brain trauma. Patients speak their native language in a foreign accent.",
        "Queen Elizabeth II has had over 30 corgis in her lifetime.",
        "Relative to their bodies, Chihuahuas have the biggest brain in the dog world.",
        "The \"mystery\" flavor of Dum Dums is a combination of the end of one batch of candy and the beginning of another.",
        "In 1971, a Dallas man named Mariano Martinez invented the frozen margarita machine. The 26-year-old was inspired by the Slurpee machine at 7-Eleven.",
        "In 2016, a rogue bloodhound named Ludvine joined a half-marathon in Alabama. She ran the entire 13.1 miles and finished in 7th place.",
        "The Library of Congress regularly receives requests for books that don't exist.The most common is the President's Book of Secrets, from the 2007 movie, National Treasure: Book of Secrets.",
        "In 2014, Tinder made its first match on the continent of Antarctica. Not surprisingly, both parties involved were research scientists.",
        "When times get tough, elephants will comfort each other by stroking loved ones with their trunks and emitting small chirps.",
        "A double rainbow occurs when sunlight is reflected twice inside a raindrop. If you look closely, you can see that the colors of the secondary rainbow appear in reverse order.",
        "There's a Nikola Tesla statue in Palo Alto that provides free Wi - Fi.",
        "The Mobile Phone Throwing World Championships are held in Finland. One winner (not pictured) said he prepared for the event by \"mainly drinking.\"",
        "Frank Sinatra has three stars on the Hollywood Walk of Fame: one for film, one for music, and one for television.",
        "One April day in 1930, the BBC reported, \"There is no news.\" Instead they played piano music.",
        "Continental plates drift as fast as fingernails grow.",
        "Elvis Presley's manager sold \"I Hate Elvis\" badges as a way to make money off of people who weren't buying his merchandise.",
        "LEGO has a temperature-controlled underground vault in Denmark with nearly every set they've ever made.",
        "A reindeer's eyes change color through the seasons.They’ re gold during the summer and blue in the winter.",
        "An avocado never ripens on the tree, so farmers can use trees as storage and keep avocados fresh for up to seven months.",
        "At the Humane Society of Missouri, kid volunteers comfort anxious shelter dogs by reading to them.",
        "In The Empire Strikes Back, an extra can be seen running with what appears to be an ice cream maker. The character became legendary among fans, and was eventually given a name (Willrow Hood) and a backstory.",
        "Salvador Dali avoided paying restaurant tabs by using checks. He would draw on the back as the waiter watched, knowing no one would ever cash the art.",
        "China owns all of the pandas in the world. They rent them out for about $1 million a year.",
        "In season two of The Joy of Painting, Bob Ross created a monochromatic landscape for a viewer who was worried that his color blindness would prevent him from being able to paint.",
        "Bones found at Seymour Island indicate that at one time, 37 to 40 million years ago, penguins stood at a formidable 6 feet tall and weighed 250 pounds."
    ],

    "animal": [
        "The heart of a shrimp is located in its head.",
        "A snail can sleep for three years.",
        "The fingerprints of a koala are so indistinguishable from humans that they have on occasion been confused at a crime scene.",
        "Slugs have four noses.",
        "Elephants are the only animal that can't jump.",
        "A rhinoceros horn is made of hair.",
        "It is possible to hypnotize a frog by placing it on its back and gently stroking its stomach.",
        "It takes a sloth two weeks to digest its food.",
        "Nearly three percent of the ice in Antarctic glaciers is penguin urine.",
        "A cow gives nearly 200,000 glasses of milk in a lifetime.",
        "Bats always turn left when leaving a cave.",
        "Giraffes have no vocal chords.",
        "Kangaroos can't fart.",
        "An ostrich's eye is bigger than its brain.",
        "Around 50 percent of orangutans have fractured bones, due to falling out of trees on a regular basis.",
        "Frogs cannot vomit. If one absolutely has to, then it will vomit its entire stomach.",
        "Some cats are allergic to humans.",
        "Goats have rectangular pupils."
    ],

    "mlp": [
        "Pinkie Pie was originally meant to be a Pegasus",
        "Rarity was originally meant to be the element of inspiration",
        "Spike is voiced by a female",
        "Trixie Lullamoon was originally meant to be male",
        "Celesta was originally going to be a queen",
        "Pinkie Pie is the only pony of the 6 whose name does not match her Cutie Mark",
        "Lauren Faust worked on the Powerpuff Girls before creating the show",
        "Daring Do is a recolour of Rainbow Dash",
        "Spitfire's voice actor did Buttercup in the PPG Anime english dub ",
        "Diamond Tiara and Sweetie Belle have the same colour scheme",
        "It is speculated that Rainbow Dash is gay",
        "Twilight Sparkle is the only one of the 6 to be an alicorn",
        "Rainbow Dash was going to be the central character",
        "Lauren Faust wanted to make it more clear Applejack's parents died ",
        "Canterlot was inspired by Minas Tirith from The Lord Of The Rings"
    ],

    "chocolate": [
        "Chocolate comes from a fruit tree; it’s made from a seed.",
        "It takes 400 cocoa beans to make one pound (0.45kg) of chocolate.",
        "Each cacao tree produces approximately 2,500 beans.",
        "Cacao beans were so valuable to early Mesoamericans that they were used as currency.",
        "“Cacao” is how you say “cocoa” in Spanish.",
        "A farmer must wait four to five years for a cacao tree to produce its first beans.",
        "Spanish royalty gave cakes of cacao in their dowries.",
        "Theobroma Cacaois the tree that produces cocoa beans, and it means “food of the gods.” Carolus Linnaeus, the father of plant taxonomy, named it.",
        "Chocolate has over 600 flavor compounds while red wine has just 200.",
        "Chocolate milk is an effective post work-out recovery drink"
    ],

    "dream": [
        "A psychological research discovered that people who used to watch monochrome television as kids, often dream in black and white.",
        "Most people have anywhere between 4 to 6 dreams per night. However, you won't always remember them. Most of us forget about 95-99% of our dreams.",
        "On rare occasions, people can have dreams in which they see what will happen in the future. Known as premonition dreams, these dreams have been documented on many different occasions including some of the worst tragedies such as the 9/11 attacks, the Titanic disaster, plane crashes, etc. Are they mere coincidence or do these people somehow tap into some supernatural foresight? There's definitely a strong debate but the short answers is \"we simply don't know\".",
        "Some people can consciously observe and even control their dreams. This unusual phenomenon is known as lucid dreaming.",
        "According to the American Psychological Association dreams recharge your creativity. Studies have shown that dreams may help ordinary people find creative solutions to their problems. It also suggests that dreams model the free association process of creativity which precedes actual creation.",
        "When we fall asleep, our brains don't shut down. Quite the opposite. Our brains become even more active. Sleep for humans is divided in two main phases (which go through 5 stages): non-REM (stages 1-4) and REM sleep (stage 5). REM sleep is where most of our dreams happen (but sometimes they happen in the non-REM phase as well), During REM sleep, our brains can become even more active than when we are awake because in simple terms, patterns of brain activity are more random and variable during this phase.",
        "Dreams occur in all five stages of sleep but nightmares tend to occur in the final stage (REM) which is associated with high brain activity, rapid eye movements and inhibited voluntary motor activity.",
        "There have been people who dreamt of inventions that they actually made later in their real life. These inventions, envisioned in dreams, include alternating current generators, DNA’s double helix, sewing machine, periodic table and guillotine.",
        "Blind people have dreams as well. People who went blind later in life have visual dreams just like anybody else. However, people who are blind from birth have dreams that feature elevated levels of sensory perception similar to how they would experience the world while they are awake.",
        "Speaking of blind people dreaming, a 2014 study done by a group of Danish researchers found that blind people have more nightmares than non-blind people. In the study, 25 percent of the blind participants experienced nightmares compared to 7 percent of the later onset group and 6 percent of the non-blind group.",
        "It's common for men to experience erections in the final REM stage of sleep. However, researchers recently discovered that these erections are not necessarily related to erotic dreams as previously thought. Nevertheless, the origin and purpose of these night erections remains unknown.",
        "Dream studies have revealed that dream experiences are mostly negative. Dreams that feature negative emotions such as fear, anger and anxiety are more common than positive dreams.",
        "Although most dreams are negative, the word “dream” itself has a positive connotation. It has its origin in the Middle English word “dreme” which means \"joy\" and \"music\".",
        "There are some differences between the dreams of men and women. Men´s dreams tend to be more violent and feature less characters than women´s. Men also dream about other men twice as often as they do about women, while women tend to dream about both sexes equally.",
        "It's estimated that in five minutes after the end of a dream, we've already forgotten 50% of it. Ten minutes later, we have forgotten 90% of it.",
        "Also known as the “spirit molecule,” Dimethyltryptamine (or DMT) is the chemical substance that is believed to be responsible for dreams. Some people enjoy dreaming so much that they use the synthetic form of the substance in order to have dreams even during the day.",
        "Some say that even the most terrifying nightmares such as those of death, monsters, being chased etc. usually do not represent bad omens. Instead, they rather signify major changes or emotional moments in your real life.",
        "Scientists say it is very likely that animals have dreams as well. Most mammals experience the REM stage of sleep in which dreams occur so it is reasonable to suppose they dream just like us. However, scientists now believe birds, reptiles, and possibly even fish, could be dreamers.",
        "Our dreams can feature many characters but our mind is not inventing them – in our dreams we see real faces of real people that we have seen during our life but may not know or remember.",
        "Not self-aware, toddlers up till the age of 4 cannot see themselves in their dreams.",
        "Sleepwalking is real and can be a potentially dangerous thing. People who sleepwalk suffer from a form of REM sleep disorder where they act out complex actions while still sleeping. There have been extreme stories involving people who sleepwalk. One guy drove 10 miles and killed his in-law, then there's a 55-year-old chef who cooks while sleeping, and probably one of the most artistic ones is a the male nurse that produces \"fantastical artworks\" while sleepwalking.",
        "To prevent us from doing things like sleepwalking, our muscles are paralyzed during REM sleep. In some cases, however, this paralysis can carry over into the waking state for as long as several minutes. This extremely unpleasant state of mind and body is known as sleep paralysis.",
        "We start to dream as early as in the prenatal stage of our life. Scientists have observed dreams in fetuses just around 7 months old and it is thought that the very first dreams (based just on sounds and sensation) can occur even earlier.",
        "According to research, the most common setting for everyone´s dreams is their own house.",
        "Dreams are usually very subjective, influenced by our personal experiences but there are several universal themes that people all over the world seem to dream of. These themes include dreams of being chased or attacked, falling, being unable to move and being naked in public."
    ]
}