{
    "dad": [
        "Did you hear about the restaurant on the moon? Great food, no atmosphere.",
        "What do you call a fake noodle? An Impasta.",
        "How many apples grow on a tree? All of them.",
        "Want to hear a joke about paper? Nevermind it's tearable.",
        "I just watched a program about beavers. It was the best dam program I've ever seen.",
        "Why did the coffee file a police report? It got mugged.",
        "How does a penguin build it's house? Igloos it together.",
        "Dad, did you get a haircut? No I got them all cut.",
        "What do you call a Mexican who has lost his car? Carlos.",
        "Dad, can you put my shoes on? No, I don't think they'll fit me.",
        "Why did the scarecrow win an award? Because he was outstanding in his field.",
        "Why don't skeletons ever go trick or treating? Because they have no body to go with.",
        "Ill call you later. Don't call me later, call me Dad.",
        "What do you call an elephant that doesn't matter? An irrelephant",
        "Want to hear a joke about construction? I'm still working on it.",
        "What do you call cheese that isn't yours? Nacho Cheese.",
        "Why couldn't the bicycle stand up by itself? It was two tired.",
        "What did the grape do when he got stepped on? He let out a little wine.",
        "I wouldn't buy anything with velcro. It's a total rip-off.",
        "The shovel was a ground-breaking invention.",
        "Dad, can you put the cat out? I didn't know it was on fire.",
        "This graveyard looks overcrowded. People must be dying to get in there.",
        "Whenever the cashier at the grocery store asks my dad if he would like the milk in a bag he replies, \"No, just leave it in the carton!\"",
        "5/4 of people admit that they’re bad with fractions.",
        "wo goldfish are in a tank. One says to the other, \"do you know how to drive this thing?\"",
        "What do you call a man with a rubber toe? Roberto.",
        "What do you call a fat psychic? A four-chin teller.",
        "I would avoid the sushi if I was you. It’s a little fishy.",
        "To the man in the wheelchair that stole my camouflage jacket... You can hide but you can't run.",
        "The rotation of earth really makes my day.",
        "I thought about going on an all-almond diet. But that's just nuts",
        "What's brown and sticky? A stick.",
        "I’ve never gone to a gun range before. I decided to give it a shot!",
        "Why do you never see elephants hiding in trees? Because they're so good at it.",
        "Did you hear about the kidnapping at school? It's fine, he woke up.",
        "A furniture store keeps calling me. All I wanted was one night stand.",
        "I used to work in a shoe recycling shop. It was sole destroying.",
        "Did I tell you the time I fell in love during a backflip? I was heels over head.",
        "I don’t play soccer because I enjoy the sport. I’m just doing it for kicks.",
        "People don’t like having to bend over to get their drinks. We really need to raise the bar."
    ],

    "funny": [
        "Today at the bank, an old lady asked me to help check her balance. So I pushed her over.",
        "I bought some shoes from a drug dealer. I don't know what he laced them with, but I've been tripping all day.",
        "I told my girlfriend she drew her eyebrows too high. She seemed surprised.",
        "My dog used to chase people on a bike a lot. It got so bad, finally I had to take his bike away.",
        "I'm so good at sleeping. I can do it with my eyes closed.",
        "My boss told me to have a good day.. so I went home.",
        "Why is Peter Pan always flying? He neverlands.",
        "A woman walks into a library and asked if they had any books about paranoia. The librarian says \"They're right behind you!\"",
        "The other day, my wife asked me to pass her lipstick but I accidentally passed her a glue stick. She still isn't talking to me.",
        "Why do blind people hate skydiving? It scares the hell out of their dogs.",
        "When you look really closely, all mirrors look like eyeballs.",
        "My friend says to me: \"What rhymes with orange\" I said: \"No it doesn't\"",
        "What do you call a guy with a rubber toe? Roberto.",
        "What did the pirate say when he turned 80 years old? Aye matey.",
        "My wife told me I had to stop acting like a flamingo. So I had to put my foot down.",
        "I couldn't figure out why the baseball kept getting larger. Then it hit me.",
        "Why did the old man fall in the well? Because he couldn't see that well.",
        "I ate a clock yesterday, it was very time consuming.",
        "Whatdya call a frenchman wearing sandals? Phillipe Phillope.",
        "A blind man walks into a bar. And a table. And a chair.",
        "I know a lot of jokes about unemployed people but none of them work.",
        "What's orange and sounds like a parrot? A carrot.",
        "Did you hear about the italian chef that died? He pasta way.",
        "Why couldn't the bicycle stand up? Because it was two tired!",
        "Parallel lines have so much in common. It’s a shame they’ll never meet.",
        "My wife accused me of being immature. I told her to get out of my fort.",
        "Where do you find a cow with no legs? Right where you left it.",
        "When a deaf person sees someone yawn do they think it’s a scream?",
        "As I suspected, someone has been adding soil to my garden. The plot thickens.",
        "How do crazy people go through the forest? They take the physco path.",
        "And the lord said unto John, \"Come forth and you will receive eternal life\". John came fifth and won a toaster.",
        "What did the traffic light say to the car? Don’t look! I’m about to change.",
        "I just wrote a book on reverse psychology. Do *not* read it!",
        "What did one hat say to the other? You stay here. I’ll go on ahead.",
        "Why wouldn’t the shrimp share his treasure? Because he was a little shellfish."
    ],
    "blond": [
        "Blonde: What does IDK stand for?  Brunette: I don’t know ,  Blonde: Why doesn’t anyone know!",
        "Why can't a blonde dial 911? She can't find the eleven.",
        "How come it takes so long to build a blonde snowman? Because you have to hollow out the head.",
        "What did the blonde say when she saw the Cheerios box? \"Omg, donut seeds!\"",
        "Two blondes fell down a hole. One said, 'It’s dark in here isn’t it?' The other replied, 'I don’t know; I can’t see.'",
        "What can strike a blonde without her even knowing it? A thought.",
        "Why did the blonde stare at frozen orange juice can for 2 hours? Because it said 'concentrate'.",
        "Why did the blonde scale the glass wall? To see what was on the other side.",
        "Why were there bullet holes in the mirror? A blonde tried killing herself.",
        "How did the blonde die while raking leaves? She fell out of the tree.",
        "What do you do if a blonde throws a grenade at you? Pull the pin and throw it back.",
        "How do you drown a blonde in a submarine? Knock on the door.",
        "Why did the blonde tip-toe past the medicine cabinet? So she wouldn’t wake up the sleeping pills.",
        "A blonde decided to paint a room. When her husband got home, he asked, 'Why are you wearing an Alaskan and a winter coat?' She replied, 'The can said for best results apply 2 coats.'",
        "How can you make a blonde go on the roof? Tell her that drinks are on the house.",
        "Three blondes walk into a building. You'd think one of them would've seen it.",
        "Why do blondes wear underwear? To keep their ankles warm.",
        "How did the blonde try to kill the bird? She threw it off a cliff.",
        "Why can't blondes make ice cubes? They always forget the recipe.",
        "Two blondes are facing each other across a wide stream. ,One yells to the other, 'How do you get to the other side?' ,The other blonde replies, 'You are on the other side!'",
        "How do you make a blonde laugh on Saturday? Tell her a joke on Wednesday.",
        "How do you make a blonde's eyes light up? Shine a flashlight in her ears.",
        "How do you confuse a blonde? Put her in a circle and tell her to go to the corner.",
        "Why did the blonde put water on her computer? To wash the Windows.",
        "What do you call a blonde with 2 brain cells? Pregnant.",
        "A blonde crashed a helicopter. A police officer asked her what happened. She says, It got cold so I turned off the fan.",
        "How do you keep a blonde busy for hours? Write 'Please turn over' on both sides of a piece of paper.",
        "How can you tell when a brunette is actually a blonde who dyes her hair? When she trips over the cordless phone.",
        "What did the blonde say when she found out she was pregnant? I wonder if it's mine.",
        "A man walks by a blonde, who is holding a pig. The man asks, \"Where did you get her?\" The pig answers, \"I won her at the fair.\"",
        "Three blondes girls were walking in the woods and came upon tracks. The first one said, \"Look, it's deer tracks.\" The second one said, \"No, it's wolf tracks\" and before the third one could answer, they got hit by a train.",
        "What's a blondes idea of safe sex? Lock the car doors.",
        "What do you call a really smart blonde? A golden retriever.",
        "What do UFO's and smart blondes have in common? You keep hearing about them, but never see any.",
        "What did the blonde say when she looked into a box of Cheerios? \"Oh look! Donut seeds!\"",
        "How did the blonde die drinking milk? The cow fell on her.",
        "What do a blonde and a beer bottle have in common? They're both empty from the neck up.",
        "What do you do if a blonde throws a grenade at you? Pull the pin and throw it back.",
        "Why should blondes not be given coffee breaks? It takes too long to retrain them.",
        "I got a compliment on my driving today said a blonde to her friend. There was a note left on my windshield it said “parking fine”."
    ],
    "corny": [
        "Why do scuba divers fall backward out of the boat? Cause if they fell forward they'd still be in the boat.",
        "What does cheese say to itself in the mirror? Halloumi.",
        "What did the daughter corn ask the mother corn? Where's popcorn.",
        "What did the stoplight say to the car? Don't look, I'm changing.",
        "What did the tired criminal need? Arrest.",
        "What’s the stupidest animal in the jungle? A polar bear.",
        "Why do cows have hooves instead of feet? They lactose.",
        "Why did the pig get hired by the restaurant? He was really good at bacon.",
        "Why do birds fly south for the winter? It's way to far to walk.",
        "How does a train eat? It goes chew chew.",
        "I’m thinking about removing my spine. I feel like it’s only holding me back.",
        "What's brown and sticky? A stick.",
        "What did the buffalo say to his son leaving to school? Bison.",
        "I had to sell my vacuum cleaner, because it was just collecting dust",
        "Why did the lion get lost? Because the jungle is massive.",
        "Two fish are in a tank. One says to the othe fish, do you know how to drive this thing?",
        "I wondered why the ball was getting bigger, and then it hit me.",
        "Why did the scarecrow win an award? Because he was outstanding in his field.",
        "Why was the cook arrested? He was caught beating an egg.",
        "Have you ever tried eating a clock? It's very time consuming!",
        "What did the ocean say to the shore? Nothing, it just waved.",
        "Why did the golfer wear two pairs of pants? In case he got a hole in one.",
        "Why did the fish get bad grades? Because it was below sea level.",
        "What’s red and shaped like a bucket? A blue bucket painted red.",
        "What did the fish say when he swam into a wall? Dam.",
        "What do you call a totally unimportant elephant? - An Irrelephant",
        "A book fell on my head, I can only blame my shelf."
    ]
}